src/cf/otusJenkinsExampleEDT/src/Documents/ЗаявкаНаОбслуживание/ЗаявкаНаОбслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаОбслуживание</name>
  <posting>Deny</posting>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаОбслуживание</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИсполнителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/cf/otusJenkinsExampleEDT/src/Enums/СтатусыЗаявокНаОбслуживание/СтатусыЗаявокНаОбслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаОбслуживание</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/cf/otusJenkinsExampleEDT/src/Documents/ЗаявкаНаОбслуживание/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыЗаявокНаОбслуживание.Новая;
	КонецЕсли;

	ПроверитьЗаполнениеЗаявки(Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеЗаявки(Отказ)

	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		СообщитьПользователюОбОшибке(
			НСтр("ru = 'Не заполнен контрагент.'"),
			"Контрагент");
		Отказ = Истина;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ОписаниеПроблемы) Тогда
		СообщитьПользователюОбОшибке(
			НСтр("ru = 'Не заполнено описание проблемы.'"),
			"ОписаниеПроблемы");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура СообщитьПользователюОбОшибке(ТекстСообщения, ИмяПоля)

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Поле = ИмяПоля;
	Сообщение.УстановитьДанные(ЭтотОбъект);
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти
